ch0t4nk/stm32h753zi/src/hal_abstraction/hal_abstraction_stm32h7.c
/**
 * @file hal_abstraction_stm32h7.c
 * @brief STM32H7 Hardware Abstraction Layer Implementation
 * @author STM32H753ZI Motor Control Project
 * @date 2024
 *
 * This file implements the HAL abstraction interface for STM32H753ZI,
 * providing hardware-specific implementations while maintaining the
 * abstract interface for application code.
 *
 * @note Only included when not in UNITY_TESTING mode
 */

#include "hal_abstraction.h"

#ifndef UNITY_TESTING
/* ==========================================================================
 */
/* STM32H7 HAL Includes                                                      */
/* ==========================================================================
 */

#include "config/hardware_config.h"
#include "stm32h7xx_hal.h"
#include "stm32h7xx_hal_iwdg.h"
#include "stm32h7xx_hal_tim.h"
#include <string.h>

/* ==========================================================================
 */
/* Driver Includes (FTR-013)                                                 */
/* ==========================================================================
 */

#include "drivers/as5600/as5600_driver.h"
#include "drivers/l6470/l6470_driver.h"

/* ==========================================================================
 */
/* Private Variables                                                         */
/* ==========================================================================
 */

// External handles from main.c or peripheral initialization
extern SPI_HandleTypeDef hspi2;
extern I2C_HandleTypeDef hi2c1;
extern I2C_HandleTypeDef hi2c2;
extern TIM_HandleTypeDef htim2;
extern TIM_HandleTypeDef htim3;
extern IWDG_HandleTypeDef hiwdg;

// Internal state tracking
static bool hal_abstraction_initialized = false;

/* ==========================================================================
 */
/* Private Helper Functions                                                  */
/* ==========================================================================
 */

/**
 * @brief Convert abstraction GPIO port to STM32 GPIO port
 */
static GPIO_TypeDef *get_stm32_gpio_port(HAL_GPIO_Port_t port) {
    switch (port) {
    case HAL_GPIO_PORT_A:
        return GPIOA;
    case HAL_GPIO_PORT_B:
        return GPIOB;
    case HAL_GPIO_PORT_C:
        return GPIOC;
    case HAL_GPIO_PORT_D:
        return GPIOD;
    case HAL_GPIO_PORT_E:
        return GPIOE;
    case HAL_GPIO_PORT_F:
        return GPIOF;
    case HAL_GPIO_PORT_G:
        return GPIOG;
    case HAL_GPIO_PORT_H:
        return GPIOH;
    default:
        return NULL;
    }
}

/**
 * @brief Convert abstraction SPI instance to STM32 SPI handle
 */
static SPI_HandleTypeDef *get_stm32_spi_handle(HAL_SPI_Instance_t instance) {
    switch (instance) {
    case HAL_SPI_INSTANCE_2:
        return &hspi2; // L6470 motor drivers
    default:
        return NULL;
    }
}

/**
 * @brief Convert abstraction I2C instance to STM32 I2C handle
 */
static I2C_HandleTypeDef *get_stm32_i2c_handle(HAL_I2C_Instance_t instance) {
    switch (instance) {
    case HAL_I2C_INSTANCE_1:
        return &hi2c1; // AS5600 encoder 1
    case HAL_I2C_INSTANCE_2:
        return &hi2c2; // AS5600 encoder 2
    default:
        return NULL;
    }
}

/**
 * @brief Convert abstraction timer instance to STM32 timer handle
 */
static TIM_HandleTypeDef *
get_stm32_timer_handle(HAL_Timer_Instance_t instance) {
    switch (instance) {
    case HAL_TIMER_INSTANCE_2:
        return &htim2; // Control loop timer
    case HAL_TIMER_INSTANCE_3:
        return &htim3; // General purpose timer
    default:
        return NULL;
    }
}

/**
 * @brief Convert HAL status to SystemError_t
 */
static SystemError_t convert_hal_status(HAL_StatusTypeDef hal_status) {
    switch (hal_status) {
    case HAL_OK:
        return SYSTEM_OK;
    case HAL_ERROR:
        return ERROR_HARDWARE_FAILURE;
    case HAL_BUSY:
        return ERROR_BUSY;
    case HAL_TIMEOUT:
        return ERROR_TIMEOUT;
    default:
        return ERROR_UNKNOWN;
    }
}

/* ==========================================================================
 */
/* GPIO Abstraction Implementation                                           */
/* ==========================================================================
 */

SystemError_t HAL_Abstraction_GPIO_Init(HAL_GPIO_Port_t port,
                                        const HAL_GPIO_Config_t *config) {
    if (config == NULL) {
        return ERROR_NULL_POINTER;
    }

    GPIO_TypeDef *gpio_port = get_stm32_gpio_port(port);
    if (gpio_port == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    // Enable GPIO clock
    switch (port) {
    case HAL_GPIO_PORT_A:
        __HAL_RCC_GPIOA_CLK_ENABLE();
        break;
    case HAL_GPIO_PORT_B:
        __HAL_RCC_GPIOB_CLK_ENABLE();
        break;
    case HAL_GPIO_PORT_C:
        __HAL_RCC_GPIOC_CLK_ENABLE();
        break;
    case HAL_GPIO_PORT_D:
        __HAL_RCC_GPIOD_CLK_ENABLE();
        break;
    case HAL_GPIO_PORT_E:
        __HAL_RCC_GPIOE_CLK_ENABLE();
        break;
    case HAL_GPIO_PORT_F:
        __HAL_RCC_GPIOF_CLK_ENABLE();
        break;
    case HAL_GPIO_PORT_G:
        __HAL_RCC_GPIOG_CLK_ENABLE();
        break;
    case HAL_GPIO_PORT_H:
        __HAL_RCC_GPIOH_CLK_ENABLE();
        break;
    default:
        return ERROR_INVALID_PARAMETER;
    }

    // Configure GPIO
    GPIO_InitTypeDef gpio_init = {0};
    gpio_init.Pin = config->pin;
    gpio_init.Mode = config->mode;
    gpio_init.Pull = config->pull;
    gpio_init.Speed = config->speed;
    gpio_init.Alternate = config->alternate;

    HAL_GPIO_Init(gpio_port, &gpio_init);

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_GPIO_Write(HAL_GPIO_Port_t port, uint32_t pin,
                                         HAL_GPIO_State_t state) {
    GPIO_TypeDef *gpio_port = get_stm32_gpio_port(port);
    if (gpio_port == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    GPIO_PinState pin_state =
        (state == HAL_GPIO_STATE_SET) ? GPIO_PIN_SET : GPIO_PIN_RESET;
    HAL_GPIO_WritePin(gpio_port, pin, pin_state);

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_GPIO_Read(HAL_GPIO_Port_t port, uint32_t pin,
                                        HAL_GPIO_State_t *state) {
    if (state == NULL) {
        return ERROR_NULL_POINTER;
    }

    GPIO_TypeDef *gpio_port = get_stm32_gpio_port(port);
    if (gpio_port == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    GPIO_PinState pin_state = HAL_GPIO_ReadPin(gpio_port, pin);
    *state = (pin_state == GPIO_PIN_SET) ? HAL_GPIO_STATE_SET
                                         : HAL_GPIO_STATE_RESET;

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_GPIO_Toggle(HAL_GPIO_Port_t port, uint32_t pin) {
    GPIO_TypeDef *gpio_port = get_stm32_gpio_port(port);
    if (gpio_port == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_GPIO_TogglePin(gpio_port, pin);

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_GPIO_EnableInterrupt(HAL_GPIO_Port_t port,
                                                   uint32_t pin,
                                                   uint32_t trigger_type,
                                                   uint8_t priority) {
    GPIO_TypeDef *gpio_port = get_stm32_gpio_port(port);
    if (gpio_port == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    // Configure GPIO for interrupt
    GPIO_InitTypeDef gpio_init = {0};
    gpio_init.Pin = pin;
    gpio_init.Mode = trigger_type;
    gpio_init.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(gpio_port, &gpio_init);

    // Configure NVIC
    IRQn_Type irqn;
    if (pin <= GPIO_PIN_4) {
        irqn = (IRQn_Type)(EXTI0_IRQn + __builtin_ctz(pin));
    } else if (pin <= GPIO_PIN_9) {
        irqn = EXTI9_5_IRQn;
    } else {
        irqn = EXTI15_10_IRQn;
    }

    HAL_NVIC_SetPriority(irqn, priority, 0);
    HAL_NVIC_EnableIRQ(irqn);

    return SYSTEM_OK;
}

