ch0t4nk/stm32h753zi/src/hal_abstraction/hal_abstraction_stm32h7.c
/* ==========================================================================
 */
/* SPI Abstraction Implementation                                            */
/* ==========================================================================
 */

SystemError_t HAL_Abstraction_SPI_Init(HAL_SPI_Instance_t instance) {
    SPI_HandleTypeDef *hspi = get_stm32_spi_handle(instance);
    if (hspi == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    // SPI should be initialized by CubeMX/main.c
    // This function validates that it's ready
    if (hspi->Instance == NULL) {
        return ERROR_NOT_INITIALIZED;
    }

    return SYSTEM_OK;
}

SystemError_t
HAL_Abstraction_SPI_TransmitReceive(HAL_SPI_Instance_t instance,
                                    const HAL_SPI_Transaction_t *transaction) {
    if (transaction == NULL) {
        return ERROR_NULL_POINTER;
    }

    SPI_HandleTypeDef *hspi = get_stm32_spi_handle(instance);
    if (hspi == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_StatusTypeDef status = HAL_SPI_TransmitReceive(
        hspi, transaction->tx_data, transaction->rx_data,
        transaction->data_size, transaction->timeout_ms);

    return convert_hal_status(status);
}

SystemError_t HAL_Abstraction_SPI_Transmit(HAL_SPI_Instance_t instance,
                                           const uint8_t *tx_data,
                                           uint16_t data_size,
                                           uint32_t timeout_ms) {
    if (tx_data == NULL) {
        return ERROR_NULL_POINTER;
    }

    SPI_HandleTypeDef *hspi = get_stm32_spi_handle(instance);
    if (hspi == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_StatusTypeDef status =
        HAL_SPI_Transmit(hspi, (uint8_t *)tx_data, data_size, timeout_ms);

    return convert_hal_status(status);
}

SystemError_t HAL_Abstraction_SPI_Receive(HAL_SPI_Instance_t instance,
                                          uint8_t *rx_data, uint16_t data_size,
                                          uint32_t timeout_ms) {
    if (rx_data == NULL) {
        return ERROR_NULL_POINTER;
    }

    SPI_HandleTypeDef *hspi = get_stm32_spi_handle(instance);
    if (hspi == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_StatusTypeDef status =
        HAL_SPI_Receive(hspi, rx_data, data_size, timeout_ms);

    return convert_hal_status(status);
}

/* ==========================================================================
 */
/* I2C Abstraction Implementation                                            */
/* ==========================================================================
 */

SystemError_t HAL_Abstraction_I2C_Init(HAL_I2C_Instance_t instance) {
    I2C_HandleTypeDef *hi2c = get_stm32_i2c_handle(instance);
    if (hi2c == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    // I2C should be initialized by CubeMX/main.c
    // This function validates that it's ready
    if (hi2c->Instance == NULL) {
        return ERROR_NOT_INITIALIZED;
    }

    return SYSTEM_OK;
}

SystemError_t
HAL_Abstraction_I2C_MemWrite(HAL_I2C_Instance_t instance,
                             const HAL_I2C_Transaction_t *transaction) {
    if (transaction == NULL || transaction->data == NULL) {
        return ERROR_NULL_POINTER;
    }

    I2C_HandleTypeDef *hi2c = get_stm32_i2c_handle(instance);
    if (hi2c == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_StatusTypeDef status;
    if (transaction->use_register_address) {
        status =
            HAL_I2C_Mem_Write(hi2c, transaction->device_address << 1,
                              transaction->register_address,
                              I2C_MEMADD_SIZE_8BIT, transaction->data,
                              transaction->data_size, transaction->timeout_ms);
    } else {
        status = HAL_I2C_Master_Transmit(
            hi2c, transaction->device_address << 1, transaction->data,
            transaction->data_size, transaction->timeout_ms);
    }

    return convert_hal_status(status);
}

SystemError_t
HAL_Abstraction_I2C_MemRead(HAL_I2C_Instance_t instance,
                            const HAL_I2C_Transaction_t *transaction) {
    if (transaction == NULL || transaction->data == NULL) {
        return ERROR_NULL_POINTER;
    }

    I2C_HandleTypeDef *hi2c = get_stm32_i2c_handle(instance);
    if (hi2c == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_StatusTypeDef status;
    if (transaction->use_register_address) {
        status =
            HAL_I2C_Mem_Read(hi2c, transaction->device_address << 1,
                             transaction->register_address,
                             I2C_MEMADD_SIZE_8BIT, transaction->data,
                             transaction->data_size, transaction->timeout_ms);
    } else {
        status = HAL_I2C_Master_Receive(
            hi2c, transaction->device_address << 1, transaction->data,
            transaction->data_size, transaction->timeout_ms);
    }

    return convert_hal_status(status);
}

SystemError_t HAL_Abstraction_I2C_Transmit(HAL_I2C_Instance_t instance,
                                           uint16_t device_address,
                                           const uint8_t *tx_data,
                                           uint16_t data_size,
                                           uint32_t timeout_ms) {
    if (tx_data == NULL) {
        return ERROR_NULL_POINTER;
    }

    I2C_HandleTypeDef *hi2c = get_stm32_i2c_handle(instance);
    if (hi2c == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_StatusTypeDef status = HAL_I2C_Master_Transmit(
        hi2c, device_address << 1, (uint8_t *)tx_data, data_size, timeout_ms);

    return convert_hal_status(status);
}

SystemError_t HAL_Abstraction_I2C_Receive(HAL_I2C_Instance_t instance,
                                          uint16_t device_address,
                                          uint8_t *rx_data, uint16_t data_size,
                                          uint32_t timeout_ms) {
    if (rx_data == NULL) {
        return ERROR_NULL_POINTER;
    }

