ch0t4nk/stm32h753zi/src/hal_abstraction/hal_abstraction_stm32h7.c
    I2C_HandleTypeDef *hi2c = get_stm32_i2c_handle(instance);
    if (hi2c == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_StatusTypeDef status = HAL_I2C_Master_Receive(
        hi2c, device_address << 1, rx_data, data_size, timeout_ms);

    return convert_hal_status(status);
}

/* ==========================================================================
 */
/* Timer Abstraction Implementation                                          */
/* ==========================================================================
 */

SystemError_t HAL_Abstraction_Timer_Init(HAL_Timer_Instance_t instance,
                                         const HAL_Timer_Config_t *config) {
    if (config == NULL) {
        return ERROR_NULL_POINTER;
    }

    TIM_HandleTypeDef *htim = get_stm32_timer_handle(instance);
    if (htim == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    // Timer should be initialized by CubeMX/main.c
    // This function validates configuration
    if (htim->Instance == NULL) {
        return ERROR_NOT_INITIALIZED;
    }

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_Timer_Start(HAL_Timer_Instance_t instance) {
    TIM_HandleTypeDef *htim = get_stm32_timer_handle(instance);
    if (htim == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_StatusTypeDef status = HAL_TIM_Base_Start_IT(htim);
    return convert_hal_status(status);
}

SystemError_t HAL_Abstraction_Timer_Stop(HAL_Timer_Instance_t instance) {
    TIM_HandleTypeDef *htim = get_stm32_timer_handle(instance);
    if (htim == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    HAL_StatusTypeDef status = HAL_TIM_Base_Stop_IT(htim);
    return convert_hal_status(status);
}

SystemError_t HAL_Abstraction_Timer_GetCounter(HAL_Timer_Instance_t instance,
                                               uint32_t *counter) {
    if (counter == NULL) {
        return ERROR_NULL_POINTER;
    }

    TIM_HandleTypeDef *htim = get_stm32_timer_handle(instance);
    if (htim == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    *counter = __HAL_TIM_GET_COUNTER(htim);
    return SYSTEM_OK;
}

/* ==========================================================================
 */
/* System Timing Abstraction Implementation                                  */
/* ==========================================================================
 */

uint32_t HAL_Abstraction_GetTick(void) {
    return HAL_GetTick();
}

void HAL_Abstraction_Delay(uint32_t delay_ms) {
    HAL_Delay(delay_ms);
}

uint32_t HAL_Abstraction_GetMicroseconds(void) {
    // Use SysTick for microsecond timing
    uint32_t tick = HAL_GetTick();
    uint32_t systick_val = SysTick->VAL;
    uint32_t systick_load = SysTick->LOAD;

    // Calculate microseconds within current millisecond
    uint32_t us_in_tick = ((systick_load - systick_val) * 1000) / systick_load;

    return (tick * 1000) + us_in_tick;
}

/* ==========================================================================
 */
/* Watchdog Abstraction Implementation                                       */
/* ==========================================================================
 */

SystemError_t HAL_Abstraction_Watchdog_Init(uint32_t timeout_ms) {
    // Watchdog should be initialized by CubeMX/main.c
    // This function validates that it's ready
    if (hiwdg.Instance == NULL) {
        return ERROR_NOT_INITIALIZED;
    }

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_Watchdog_Refresh(void) {
    HAL_StatusTypeDef status = HAL_IWDG_Refresh(&hiwdg);
    return convert_hal_status(status);
}

/* ==========================================================================
 */
/* System Control Abstraction Implementation                                 */
/* ==========================================================================
 */

SystemError_t HAL_Abstraction_Init(void) {
    if (hal_abstraction_initialized) {
        return SYSTEM_OK;
    }

    // Validate that required peripherals are initialized
    SystemError_t result;

    result = HAL_Abstraction_SPI_Init(HAL_SPI_INSTANCE_2);
    if (result != SYSTEM_OK) {
        return result;
    }

    result = HAL_Abstraction_I2C_Init(HAL_I2C_INSTANCE_1);
    if (result != SYSTEM_OK) {
        return result;
    }

    result = HAL_Abstraction_I2C_Init(HAL_I2C_INSTANCE_2);
    if (result != SYSTEM_OK) {
        return result;
    }

    hal_abstraction_initialized = true;
    return SYSTEM_OK;
}

void HAL_Abstraction_EnableInterrupts(void) {
    __enable_irq();
}

void HAL_Abstraction_DisableInterrupts(void) {
    __disable_irq();
}

void HAL_Abstraction_SystemReset(void) {
    HAL_NVIC_SystemReset();
}

/* ==========================================================================
 */
/* Configuration Functions Implementation */
/* ==========================================================================
 */

SystemError_t HAL_Abstraction_ConfigureMotorControlHardware(void) {
    SystemError_t result;

    // Configure L6470 SPI CS pin
    HAL_GPIO_Config_t cs_config = {.pin = MOTOR_SPI_CS_PIN,
                                   .mode = GPIO_MODE_OUTPUT_PP,
                                   .pull = GPIO_NOPULL,
                                   .speed = GPIO_SPEED_FREQ_HIGH,
                                   .alternate = 0};
    result = HAL_Abstraction_GPIO_Init(HAL_GPIO_PORT_A, &cs_config);
    if (result != SYSTEM_OK)
        return result;

    // Set CS high (inactive)
    result = HAL_Abstraction_GPIO_Write(HAL_GPIO_PORT_A, MOTOR_SPI_CS_PIN,
                                        HAL_GPIO_STATE_SET);
    if (result != SYSTEM_OK)
        return result;

    // Configure L6470 FLAG pin (input with pull-up)
    HAL_GPIO_Config_t flag_config = {.pin = MOTOR_FLAG_PIN,
                                     .mode = GPIO_MODE_INPUT,
                                     .pull = GPIO_PULLUP,
                                     .speed = GPIO_SPEED_FREQ_LOW,
                                     .alternate = 0};
    result = HAL_Abstraction_GPIO_Init(HAL_GPIO_PORT_A, &flag_config);
    if (result != SYSTEM_OK)
        return result;

