ch0t4nk/stm32h753zi/src/hal_abstraction/hal_abstraction_stm32h7.c
    // Configure L6470 BUSY pin (input with pull-up)
    HAL_GPIO_Config_t busy_config = {.pin = MOTOR_BUSY_PIN,
                                     .mode = GPIO_MODE_INPUT,
                                     .pull = GPIO_PULLUP,
                                     .speed = GPIO_SPEED_FREQ_LOW,
                                     .alternate = 0};
    result = HAL_Abstraction_GPIO_Init(HAL_GPIO_PORT_A, &busy_config);

    return result;
}

SystemError_t HAL_Abstraction_ConfigureSafetyHardware(void) {
    SystemError_t result;

    // Configure emergency stop button (input with pull-up)
    HAL_GPIO_Config_t estop_config = {.pin = USER_BUTTON_PIN,
                                      .mode = GPIO_MODE_IT_FALLING,
                                      .pull = GPIO_PULLUP,
                                      .speed = GPIO_SPEED_FREQ_LOW,
                                      .alternate = 0};
    result = HAL_Abstraction_GPIO_Init(HAL_GPIO_PORT_C, &estop_config);
    if (result != SYSTEM_OK)
        return result;

    // Enable emergency stop interrupt
    result = HAL_Abstraction_GPIO_EnableInterrupt(
        HAL_GPIO_PORT_C, USER_BUTTON_PIN, GPIO_MODE_IT_FALLING,
        0); // Highest priority
    if (result != SYSTEM_OK)
        return result;

    // Configure status LEDs
    HAL_GPIO_Config_t led_config = {.pin = LED_GREEN_PIN,
                                    .mode = GPIO_MODE_OUTPUT_PP,
                                    .pull = GPIO_NOPULL,
                                    .speed = GPIO_SPEED_FREQ_LOW,
                                    .alternate = 0};
    result = HAL_Abstraction_GPIO_Init(HAL_GPIO_PORT_B, &led_config);
    if (result != SYSTEM_OK)
        return result;

    led_config.pin = LED_RED_PIN;
    result = HAL_Abstraction_GPIO_Init(HAL_GPIO_PORT_B, &led_config);

    return result;
}

SystemError_t HAL_Abstraction_ConfigureCommunicationHardware(void) {
    // Communication interfaces (SPI, I2C) are configured by CubeMX
    // This function validates they are ready for use
    SystemError_t result;

    result = HAL_Abstraction_SPI_Init(HAL_SPI_INSTANCE_2);
    if (result != SYSTEM_OK)
        return result;

    result = HAL_Abstraction_I2C_Init(HAL_I2C_INSTANCE_1);
    if (result != SYSTEM_OK)
        return result;

    result = HAL_Abstraction_I2C_Init(HAL_I2C_INSTANCE_2);

    return result;
}

/* ==========================================================================
 */
/* Driver Abstraction Implementation (FTR-013)                              */
/* ==========================================================================
 */

/**
 * @brief AS5600 Encoder Driver Implementation
 *
 * Real hardware implementation that calls actual AS5600 driver functions.
 * These functions bridge the HAL abstraction to concrete driver
 * implementations.
 */

SystemError_t HAL_Abstraction_AS5600_Init(uint8_t encoder_id) {
    // FTR-013: AS5600 encoder initialization through actual driver
    // This function bridges HAL abstraction to actual AS5600 driver

    SystemError_t result = as5600_init_encoder(encoder_id);

    // HARDWARE_GATING: AS5600 I2C communication requires physical hardware
    // connection
    // TODO_HARDWARE: Complete AS5600 I2C wiring and test with actual encoder
    // hardware STUB_REMOVAL: This implementation replaces previous stub -
    // FTR-013 progress

    if (result != SYSTEM_OK) {
        // Log hardware initialization failure for debugging
        // In production, this would trigger system health monitoring
        return result;
    }

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_AS5600_ReadAngle(uint8_t encoder_id,
                                               float *angle_degrees) {
    // FTR-013: AS5600 angle reading through actual driver
    // This function bridges HAL abstraction to actual AS5600 driver

    if (angle_degrees == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    SystemError_t result =
        as5600_read_angle_degrees(encoder_id, angle_degrees);

    // HARDWARE_GATING: AS5600 I2C read operations require physical hardware
    // connection
    // TODO_HARDWARE: Verify AS5600 magnet positioning and I2C signal integrity
    // STUB_REMOVAL: This implementation replaces previous stub - FTR-013
    // progress

    if (result != SYSTEM_OK) {
        // Set safe default value on hardware communication failure
        *angle_degrees = 0.0f;
        return result;
    }

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_AS5600_CheckMagnet(uint8_t encoder_id,
                                                 bool *magnet_detected) {
    // FTR-013: AS5600 magnet detection through actual driver
    // This function bridges HAL abstraction to actual AS5600 driver

    if (magnet_detected == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    SystemError_t result = as5600_check_magnet(encoder_id, magnet_detected);

    // HARDWARE_GATING: AS5600 magnet detection requires physical hardware with
    // proper magnet positioning
    // TODO_HARDWARE: Verify AS5600 magnet strength and positioning for
    // reliable detection STUB_REMOVAL: This implementation replaces previous
    // stub - FTR-013 progress SAFETY_CRITICAL: Magnet detection failure could
    // indicate encoder hardware fault

    if (result != SYSTEM_OK) {
        // Conservative safety approach: assume no magnet detected on
        // communication failure
        *magnet_detected = false;
        return result;
    }

    return SYSTEM_OK;
}

/**
 * @brief L6470 Motor Driver Implementation
 *
 * Real hardware implementation that calls actual L6470 driver functions.
 * These functions bridge the HAL abstraction to concrete driver
 * implementations.
 */

SystemError_t HAL_Abstraction_L6470_Init(uint8_t motor_id) {
    // FTR-013: L6470 stepper driver initialization through actual driver
    // This function bridges HAL abstraction to actual L6470 driver

    SystemError_t result = l6470_init_motor(motor_id);

    // HARDWARE_GATING: L6470 SPI communication requires physical hardware
    // connection and power
    // TODO_HARDWARE: Verify L6470 power supply, SPI wiring, and FLAG/BUSY pin
    // connections STUB_REMOVAL: This implementation replaces previous stub -
    // FTR-013 progress SAFETY_CRITICAL: L6470 initialization failure prevents
    // motor control - system should remain in safe state

    if (result != SYSTEM_OK) {
        // Log initialization failure for system health monitoring
        // Motor control should remain disabled until successful initialization
        return result;
    }

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_L6470_GetStatus(uint8_t motor_id,
                                              uint32_t *status) {
    // FTR-013: L6470 status reading through actual driver
    // This function bridges HAL abstraction to actual L6470 driver

    if (status == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    // L6470 driver uses uint16_t for status, HAL abstraction uses uint32_t
    uint16_t driver_status = 0;
    SystemError_t result = l6470_get_status(motor_id, &driver_status);

