ch0t4nk/stm32h753zi/src/hal_abstraction/hal_abstraction_stm32h7.c
    // HARDWARE_GATING: L6470 status reading requires functional SPI
    // communication and powered L6470
    // TODO_HARDWARE: Test L6470 status register reads under various motor
    // states STUB_REMOVAL: This implementation replaces previous stub -
    // FTR-013 progress SAFETY_CRITICAL: Status register contains fault flags -
    // essential for safety monitoring

    if (result != SYSTEM_OK) {
        // Set conservative status on communication failure
        // Clear all status bits except for communication error indication
        *status = 0x00000000; // All fault flags set (safe state)
        return result;
    }

    // Convert uint16_t driver status to uint32_t HAL abstraction format
    *status = (uint32_t)driver_status;

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_L6470_GetParameter(uint8_t motor_id,
                                                 uint8_t param,
                                                 uint32_t *value) {
    // FTR-013: L6470 parameter reading through actual driver
    // This function bridges HAL abstraction to actual L6470 driver

    if (value == NULL) {
        return ERROR_INVALID_PARAMETER;
    }

    SystemError_t result = l6470_get_parameter(motor_id, param, value);

    // HARDWARE_GATING: L6470 parameter reading requires functional SPI and
    // correct register addressing
    // TODO_HARDWARE: Validate L6470 parameter register access patterns and
    // timing STUB_REMOVAL: This implementation replaces previous stub -
    // FTR-013 progress SAFETY_CONSIDERATION: Parameter values affect motor
    // behavior - validate against SSOT motor config

    if (result != SYSTEM_OK) {
        // Set safe default parameter value on communication failure
        *value = 0;
        return result;
    }

    return SYSTEM_OK;
}

SystemError_t HAL_Abstraction_L6470_HardStop(uint8_t motor_id) {
    // FTR-013: L6470 hard stop through actual driver
    // This function bridges HAL abstraction to actual L6470 driver
    // SAFETY_CRITICAL: Hard stop is emergency safety function - must succeed

    SystemError_t result = l6470_hard_stop(motor_id);

    // HARDWARE_GATING: L6470 hard stop requires functional SPI communication
    // TODO_HARDWARE: Test hard stop command timing and verify immediate motor
    // stopping STUB_REMOVAL: This implementation replaces previous stub -
    // FTR-013 progress SAFETY_CRITICAL: Hard stop failure is a safety hazard -
    // system should enter fault state

    if (result != SYSTEM_OK) {
        // Hard stop failure is critical - log and potentially trigger
        // emergency procedures Consider hardware-level motor power
        // disconnection as backup
        return result;
    }

    return SYSTEM_OK;
}

#endif /* !UNITY_TESTING */
